gitpan/zxid/c/saml2md-enc.c
char* zxmd_ENC_SO_ds_Reference(struct zxmd_ds_Reference_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "Reference", sizeof("Reference") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->Id, "Id", sizeof("Id")-1);
  p = zx_attr_enc(p, x->URI, "URI", sizeof("URI")-1);
  p = zx_attr_enc(p, x->Type, "Type", sizeof("Type")-1);


  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  
  {
      struct zxmd_ds_Transforms_s* e;
      for (e = x->Transforms; e; e = (struct zxmd_ds_Transforms_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_ds_Transforms(e, p);
  }
  {
      struct zxmd_ds_DigestMethod_s* e;
      for (e = x->DigestMethod; e; e = (struct zxmd_ds_DigestMethod_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_ds_DigestMethod(e, p);
  }
  for (se = x->DigestValue; se; se = (struct zx_elem_s*)se->g.n)
    p = zxmd_ENC_SO_simple_elem(se, p, "DigestValue", sizeof("DigestValue") - 1);


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  ZX_OUT_CH(p, '/');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "Reference", sizeof("Reference") - 1);
  ZX_OUT_CH(p, '>');
#else
  /* root node has no end tag ither */
#endif
  return p;
}

/* FUNC(zxmd_ENC_WO_ds_Reference) */

/* Render element into string. The XML attributes and elements are
 * processed in wire order by chasing wo pointers. This is what you want for
 * validating signatures on other people's XML documents. */

char* zxmd_ENC_WO_ds_Reference(struct zxmd_ds_Reference_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zxmd_EASY_ENC_SO_ds_Reference) */

struct zx_str_s* zxmd_EASY_ENC_SO_ds_Reference(struct zx_ctx* c, struct zxmd_ds_Reference_s* x )
{
  int len = zxmd_LEN_ds_Reference(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_SO_ds_Reference(x, buf ), buf, len);
}

/* FUNC(zxmd_EASY_ENC_WO_ds_Reference) */

struct zx_str_s* zxmd_EASY_ENC_WO_ds_Reference(struct zx_ctx* c, struct zxmd_ds_Reference_s* x )
{
  int len = zxmd_LEN_ds_Reference(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_WO_ds_Reference(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_RetrievalMethod
#define EL_STRUCT zxmd_ds_RetrievalMethod_s
#define EL_NS     ds
#define EL_TAG    RetrievalMethod

/* FUNC(zxmd_LEN_ds_RetrievalMethod) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_ds_RetrievalMethod(struct zxmd_ds_RetrievalMethod_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("RetrievalMethod") - 1 + 1 + 2 + sizeof("RetrievalMethod") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */

  len += zx_attr_len(x->URI, sizeof("URI"));
  len += zx_attr_len(x->Type, sizeof("Type"));

  {
      struct zxmd_ds_Transforms_s* e;
      for (e = x->Transforms; e; e = (struct zxmd_ds_Transforms_s*)e->gg.g.n)
	  len += zxmd_LEN_ds_Transforms(e);
  }


  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_ds_RetrievalMethod) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_ds_RetrievalMethod(struct zxmd_ds_RetrievalMethod_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "RetrievalMethod", sizeof("RetrievalMethod") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->URI, "URI", sizeof("URI")-1);
  p = zx_attr_enc(p, x->Type, "Type", sizeof("Type")-1);


  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  
  {
      struct zxmd_ds_Transforms_s* e;
      for (e = x->Transforms; e; e = (struct zxmd_ds_Transforms_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_ds_Transforms(e, p);
  }


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  ZX_OUT_CH(p, '/');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "RetrievalMethod", sizeof("RetrievalMethod") - 1);
  ZX_OUT_CH(p, '>');
#else
  /* root node has no end tag ither */
#endif
  return p;
}

/* FUNC(zxmd_ENC_WO_ds_RetrievalMethod) */

/* Render element into string. The XML attributes and elements are
 * processed in wire order by chasing wo pointers. This is what you want for
 * validating signatures on other people's XML documents. */

char* zxmd_ENC_WO_ds_RetrievalMethod(struct zxmd_ds_RetrievalMethod_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zxmd_EASY_ENC_SO_ds_RetrievalMethod) */

struct zx_str_s* zxmd_EASY_ENC_SO_ds_RetrievalMethod(struct zx_ctx* c, struct zxmd_ds_RetrievalMethod_s* x )
{
  int len = zxmd_LEN_ds_RetrievalMethod(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_SO_ds_RetrievalMethod(x, buf ), buf, len);
}

/* FUNC(zxmd_EASY_ENC_WO_ds_RetrievalMethod) */

struct zx_str_s* zxmd_EASY_ENC_WO_ds_RetrievalMethod(struct zx_ctx* c, struct zxmd_ds_RetrievalMethod_s* x )
{
  int len = zxmd_LEN_ds_RetrievalMethod(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_WO_ds_RetrievalMethod(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_SPKIData
#define EL_STRUCT zxmd_ds_SPKIData_s
#define EL_NS     ds
#define EL_TAG    SPKIData

/* FUNC(zxmd_LEN_ds_SPKIData) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_ds_SPKIData(struct zxmd_ds_SPKIData_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("SPKIData") - 1 + 1 + 2 + sizeof("SPKIData") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
