gitpan/zxid/c/saml2md-enc.c
int zxmd_LEN_md_ArtifactResolutionService(struct zxmd_md_ArtifactResolutionService_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("ArtifactResolutionService") - 1 + 1 + 2 + sizeof("ArtifactResolutionService") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */

  len += zx_attr_len(x->Binding, sizeof("Binding"));
  len += zx_attr_len(x->Location, sizeof("Location"));
  len += zx_attr_len(x->ResponseLocation, sizeof("ResponseLocation"));
  len += zx_attr_len(x->index, sizeof("index"));
  len += zx_attr_len(x->isDefault, sizeof("isDefault"));



  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_md_ArtifactResolutionService) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_md_ArtifactResolutionService(struct zxmd_md_ArtifactResolutionService_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "ArtifactResolutionService", sizeof("ArtifactResolutionService") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->Binding, "Binding", sizeof("Binding")-1);
  p = zx_attr_enc(p, x->Location, "Location", sizeof("Location")-1);
  p = zx_attr_enc(p, x->ResponseLocation, "ResponseLocation", sizeof("ResponseLocation")-1);
  p = zx_attr_enc(p, x->index, "index", sizeof("index")-1);
  p = zx_attr_enc(p, x->isDefault, "isDefault", sizeof("isDefault")-1);


  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  ZX_OUT_CH(p, '/');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "ArtifactResolutionService", sizeof("ArtifactResolutionService") - 1);
  ZX_OUT_CH(p, '>');
#else
  /* root node has no end tag ither */
#endif
  return p;
}

/* FUNC(zxmd_ENC_WO_md_ArtifactResolutionService) */

/* Render element into string. The XML attributes and elements are
 * processed in wire order by chasing wo pointers. This is what you want for
 * validating signatures on other people's XML documents. */

char* zxmd_ENC_WO_md_ArtifactResolutionService(struct zxmd_md_ArtifactResolutionService_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zxmd_EASY_ENC_SO_md_ArtifactResolutionService) */

struct zx_str_s* zxmd_EASY_ENC_SO_md_ArtifactResolutionService(struct zx_ctx* c, struct zxmd_md_ArtifactResolutionService_s* x )
{
  int len = zxmd_LEN_md_ArtifactResolutionService(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_SO_md_ArtifactResolutionService(x, buf ), buf, len);
}

/* FUNC(zxmd_EASY_ENC_WO_md_ArtifactResolutionService) */

struct zx_str_s* zxmd_EASY_ENC_WO_md_ArtifactResolutionService(struct zx_ctx* c, struct zxmd_md_ArtifactResolutionService_s* x )
{
  int len = zxmd_LEN_md_ArtifactResolutionService(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_WO_md_ArtifactResolutionService(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   md_AssertionConsumerService
#define EL_STRUCT zxmd_md_AssertionConsumerService_s
#define EL_NS     md
#define EL_TAG    AssertionConsumerService

/* FUNC(zxmd_LEN_md_AssertionConsumerService) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_md_AssertionConsumerService(struct zxmd_md_AssertionConsumerService_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("AssertionConsumerService") - 1 + 1 + 2 + sizeof("AssertionConsumerService") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */

  len += zx_attr_len(x->Binding, sizeof("Binding"));
  len += zx_attr_len(x->Location, sizeof("Location"));
  len += zx_attr_len(x->ResponseLocation, sizeof("ResponseLocation"));
  len += zx_attr_len(x->index, sizeof("index"));
  len += zx_attr_len(x->isDefault, sizeof("isDefault"));



  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_md_AssertionConsumerService) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_md_AssertionConsumerService(struct zxmd_md_AssertionConsumerService_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "AssertionConsumerService", sizeof("AssertionConsumerService") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->Binding, "Binding", sizeof("Binding")-1);
  p = zx_attr_enc(p, x->Location, "Location", sizeof("Location")-1);
  p = zx_attr_enc(p, x->ResponseLocation, "ResponseLocation", sizeof("ResponseLocation")-1);
  p = zx_attr_enc(p, x->index, "index", sizeof("index")-1);
  p = zx_attr_enc(p, x->isDefault, "isDefault", sizeof("isDefault")-1);


