gitpan/zxid/c/saml2md-enc.c
/* FUNC(zxmd_LEN_md_AttributeConsumingService) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_md_AttributeConsumingService(struct zxmd_md_AttributeConsumingService_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("AttributeConsumingService") - 1 + 1 + 2 + sizeof("AttributeConsumingService") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */

  len += zx_attr_len(x->index, sizeof("index"));
  len += zx_attr_len(x->isDefault, sizeof("isDefault"));

  {
      struct zxmd_md_ServiceName_s* e;
      for (e = x->ServiceName; e; e = (struct zxmd_md_ServiceName_s*)e->gg.g.n)
	  len += zxmd_LEN_md_ServiceName(e);
  }
  {
      struct zxmd_md_ServiceDescription_s* e;
      for (e = x->ServiceDescription; e; e = (struct zxmd_md_ServiceDescription_s*)e->gg.g.n)
	  len += zxmd_LEN_md_ServiceDescription(e);
  }
  {
      struct zxmd_md_RequestedAttribute_s* e;
      for (e = x->RequestedAttribute; e; e = (struct zxmd_md_RequestedAttribute_s*)e->gg.g.n)
	  len += zxmd_LEN_md_RequestedAttribute(e);
  }


  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_md_AttributeConsumingService) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_md_AttributeConsumingService(struct zxmd_md_AttributeConsumingService_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "AttributeConsumingService", sizeof("AttributeConsumingService") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->index, "index", sizeof("index")-1);
  p = zx_attr_enc(p, x->isDefault, "isDefault", sizeof("isDefault")-1);


  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  
  {
      struct zxmd_md_ServiceName_s* e;
      for (e = x->ServiceName; e; e = (struct zxmd_md_ServiceName_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_ServiceName(e, p);
  }
  {
      struct zxmd_md_ServiceDescription_s* e;
      for (e = x->ServiceDescription; e; e = (struct zxmd_md_ServiceDescription_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_ServiceDescription(e, p);
  }
  {
      struct zxmd_md_RequestedAttribute_s* e;
      for (e = x->RequestedAttribute; e; e = (struct zxmd_md_RequestedAttribute_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_RequestedAttribute(e, p);
  }


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  ZX_OUT_CH(p, '/');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "AttributeConsumingService", sizeof("AttributeConsumingService") - 1);
  ZX_OUT_CH(p, '>');
#else
  /* root node has no end tag ither */
#endif
  return p;
}

/* FUNC(zxmd_ENC_WO_md_AttributeConsumingService) */

/* Render element into string. The XML attributes and elements are
 * processed in wire order by chasing wo pointers. This is what you want for
 * validating signatures on other people's XML documents. */

char* zxmd_ENC_WO_md_AttributeConsumingService(struct zxmd_md_AttributeConsumingService_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zxmd_EASY_ENC_SO_md_AttributeConsumingService) */

struct zx_str_s* zxmd_EASY_ENC_SO_md_AttributeConsumingService(struct zx_ctx* c, struct zxmd_md_AttributeConsumingService_s* x )
{
  int len = zxmd_LEN_md_AttributeConsumingService(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_SO_md_AttributeConsumingService(x, buf ), buf, len);
}

/* FUNC(zxmd_EASY_ENC_WO_md_AttributeConsumingService) */

struct zx_str_s* zxmd_EASY_ENC_WO_md_AttributeConsumingService(struct zx_ctx* c, struct zxmd_md_AttributeConsumingService_s* x )
{
  int len = zxmd_LEN_md_AttributeConsumingService(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_WO_md_AttributeConsumingService(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   md_AttributeService
#define EL_STRUCT zxmd_md_AttributeService_s
#define EL_NS     md
#define EL_TAG    AttributeService

/* FUNC(zxmd_LEN_md_AttributeService) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_md_AttributeService(struct zxmd_md_AttributeService_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("AttributeService") - 1 + 1 + 2 + sizeof("AttributeService") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */

  len += zx_attr_len(x->Binding, sizeof("Binding"));
  len += zx_attr_len(x->Location, sizeof("Location"));
  len += zx_attr_len(x->ResponseLocation, sizeof("ResponseLocation"));



  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_md_AttributeService) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_md_AttributeService(struct zxmd_md_AttributeService_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "AttributeService", sizeof("AttributeService") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->Binding, "Binding", sizeof("Binding")-1);
  p = zx_attr_enc(p, x->Location, "Location", sizeof("Location")-1);
  p = zx_attr_enc(p, x->ResponseLocation, "ResponseLocation", sizeof("ResponseLocation")-1);


