gitpan/zxid/c/saml2md-enc.c
  p = zx_attr_enc(p, x->entityID, "entityID", sizeof("entityID")-1);
  p = zx_attr_enc(p, x->validUntil, "validUntil", sizeof("validUntil")-1);
  p = zx_attr_enc(p, x->cacheDuration, "cacheDuration", sizeof("cacheDuration")-1);
  p = zx_attr_enc(p, x->ID, "ID", sizeof("ID")-1);


  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  
  {
      struct zxmd_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_ds_Signature(e, p);
  }
  {
      struct zxmd_md_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_Extensions(e, p);
  }
  {
      struct zxmd_md_RoleDescriptor_s* e;
      for (e = x->RoleDescriptor; e; e = (struct zxmd_md_RoleDescriptor_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_RoleDescriptor(e, p);
  }
  {
      struct zxmd_md_IDPSSODescriptor_s* e;
      for (e = x->IDPSSODescriptor; e; e = (struct zxmd_md_IDPSSODescriptor_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_IDPSSODescriptor(e, p);
  }
  {
      struct zxmd_md_SPSSODescriptor_s* e;
      for (e = x->SPSSODescriptor; e; e = (struct zxmd_md_SPSSODescriptor_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_SPSSODescriptor(e, p);
  }
  {
      struct zxmd_md_AuthnAuthorityDescriptor_s* e;
      for (e = x->AuthnAuthorityDescriptor; e; e = (struct zxmd_md_AuthnAuthorityDescriptor_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_AuthnAuthorityDescriptor(e, p);
  }
  {
      struct zxmd_md_AttributeAuthorityDescriptor_s* e;
      for (e = x->AttributeAuthorityDescriptor; e; e = (struct zxmd_md_AttributeAuthorityDescriptor_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_AttributeAuthorityDescriptor(e, p);
  }
  {
      struct zxmd_md_PDPDescriptor_s* e;
      for (e = x->PDPDescriptor; e; e = (struct zxmd_md_PDPDescriptor_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_PDPDescriptor(e, p);
  }
  {
      struct zxmd_md_AffiliationDescriptor_s* e;
      for (e = x->AffiliationDescriptor; e; e = (struct zxmd_md_AffiliationDescriptor_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_AffiliationDescriptor(e, p);
  }
  {
      struct zxmd_md_Organization_s* e;
      for (e = x->Organization; e; e = (struct zxmd_md_Organization_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_Organization(e, p);
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      for (e = x->ContactPerson; e; e = (struct zxmd_md_ContactPerson_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_ContactPerson(e, p);
  }
  {
      struct zxmd_md_AdditionalMetadataLocation_s* e;
      for (e = x->AdditionalMetadataLocation; e; e = (struct zxmd_md_AdditionalMetadataLocation_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_AdditionalMetadataLocation(e, p);
  }


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  ZX_OUT_CH(p, '/');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "EntityDescriptor", sizeof("EntityDescriptor") - 1);
  ZX_OUT_CH(p, '>');
#else
  /* root node has no end tag ither */
#endif
  return p;
}

/* FUNC(zxmd_ENC_WO_md_EntityDescriptor) */

/* Render element into string. The XML attributes and elements are
 * processed in wire order by chasing wo pointers. This is what you want for
 * validating signatures on other people's XML documents. */

char* zxmd_ENC_WO_md_EntityDescriptor(struct zxmd_md_EntityDescriptor_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zxmd_EASY_ENC_SO_md_EntityDescriptor) */

struct zx_str_s* zxmd_EASY_ENC_SO_md_EntityDescriptor(struct zx_ctx* c, struct zxmd_md_EntityDescriptor_s* x )
{
  int len = zxmd_LEN_md_EntityDescriptor(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_SO_md_EntityDescriptor(x, buf ), buf, len);
}

/* FUNC(zxmd_EASY_ENC_WO_md_EntityDescriptor) */

struct zx_str_s* zxmd_EASY_ENC_WO_md_EntityDescriptor(struct zx_ctx* c, struct zxmd_md_EntityDescriptor_s* x )
{
  int len = zxmd_LEN_md_EntityDescriptor(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_WO_md_EntityDescriptor(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   md_Extensions
#define EL_STRUCT zxmd_md_Extensions_s
#define EL_NS     md
#define EL_TAG    Extensions

/* FUNC(zxmd_LEN_md_Extensions) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_md_Extensions(struct zxmd_md_Extensions_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("Extensions") - 1 + 1 + 2 + sizeof("Extensions") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */




  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_md_Extensions) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_md_Extensions(struct zxmd_md_Extensions_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "Extensions", sizeof("Extensions") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */



  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
