gitpan/zxid/c/saml2md-enc.c
  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  
  {
      struct zxmd_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_ds_Signature(e, p);
  }
  {
      struct zxmd_md_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_Extensions(e, p);
  }
  {
      struct zxmd_md_KeyDescriptor_s* e;
      for (e = x->KeyDescriptor; e; e = (struct zxmd_md_KeyDescriptor_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_KeyDescriptor(e, p);
  }
  {
      struct zxmd_md_Organization_s* e;
      for (e = x->Organization; e; e = (struct zxmd_md_Organization_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_Organization(e, p);
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      for (e = x->ContactPerson; e; e = (struct zxmd_md_ContactPerson_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_ContactPerson(e, p);
  }
  {
      struct zxmd_md_ArtifactResolutionService_s* e;
      for (e = x->ArtifactResolutionService; e; e = (struct zxmd_md_ArtifactResolutionService_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_ArtifactResolutionService(e, p);
  }
  {
      struct zxmd_md_SingleLogoutService_s* e;
      for (e = x->SingleLogoutService; e; e = (struct zxmd_md_SingleLogoutService_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_SingleLogoutService(e, p);
  }
  {
      struct zxmd_md_ManageNameIDService_s* e;
      for (e = x->ManageNameIDService; e; e = (struct zxmd_md_ManageNameIDService_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_ManageNameIDService(e, p);
  }
  for (se = x->NameIDFormat; se; se = (struct zx_elem_s*)se->g.n)
    p = zxmd_ENC_SO_simple_elem(se, p, "NameIDFormat", sizeof("NameIDFormat") - 1);
  {
      struct zxmd_md_SingleSignOnService_s* e;
      for (e = x->SingleSignOnService; e; e = (struct zxmd_md_SingleSignOnService_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_SingleSignOnService(e, p);
  }
  {
      struct zxmd_md_NameIDMappingService_s* e;
      for (e = x->NameIDMappingService; e; e = (struct zxmd_md_NameIDMappingService_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_NameIDMappingService(e, p);
  }
  {
      struct zxmd_md_AssertionIDRequestService_s* e;
      for (e = x->AssertionIDRequestService; e; e = (struct zxmd_md_AssertionIDRequestService_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_AssertionIDRequestService(e, p);
  }
  for (se = x->AttributeProfile; se; se = (struct zx_elem_s*)se->g.n)
    p = zxmd_ENC_SO_simple_elem(se, p, "AttributeProfile", sizeof("AttributeProfile") - 1);
  {
      struct zxmd_sa_Attribute_s* e;
      for (e = x->Attribute; e; e = (struct zxmd_sa_Attribute_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_sa_Attribute(e, p);
  }


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  ZX_OUT_CH(p, '/');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "IDPSSODescriptor", sizeof("IDPSSODescriptor") - 1);
  ZX_OUT_CH(p, '>');
#else
  /* root node has no end tag ither */
#endif
  return p;
}

/* FUNC(zxmd_ENC_WO_md_IDPSSODescriptor) */

/* Render element into string. The XML attributes and elements are
 * processed in wire order by chasing wo pointers. This is what you want for
 * validating signatures on other people's XML documents. */

char* zxmd_ENC_WO_md_IDPSSODescriptor(struct zxmd_md_IDPSSODescriptor_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zxmd_EASY_ENC_SO_md_IDPSSODescriptor) */

struct zx_str_s* zxmd_EASY_ENC_SO_md_IDPSSODescriptor(struct zx_ctx* c, struct zxmd_md_IDPSSODescriptor_s* x )
{
  int len = zxmd_LEN_md_IDPSSODescriptor(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_SO_md_IDPSSODescriptor(x, buf ), buf, len);
}

/* FUNC(zxmd_EASY_ENC_WO_md_IDPSSODescriptor) */

struct zx_str_s* zxmd_EASY_ENC_WO_md_IDPSSODescriptor(struct zx_ctx* c, struct zxmd_md_IDPSSODescriptor_s* x )
{
  int len = zxmd_LEN_md_IDPSSODescriptor(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_WO_md_IDPSSODescriptor(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   md_KeyDescriptor
#define EL_STRUCT zxmd_md_KeyDescriptor_s
#define EL_NS     md
#define EL_TAG    KeyDescriptor

/* FUNC(zxmd_LEN_md_KeyDescriptor) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_md_KeyDescriptor(struct zxmd_md_KeyDescriptor_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("KeyDescriptor") - 1 + 1 + 2 + sizeof("KeyDescriptor") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */

  len += zx_attr_len(x->use, sizeof("use"));

  {
      struct zxmd_ds_KeyInfo_s* e;
      for (e = x->KeyInfo; e; e = (struct zxmd_ds_KeyInfo_s*)e->gg.g.n)
	  len += zxmd_LEN_ds_KeyInfo(e);
  }
  {
      struct zxmd_md_EncryptionMethod_s* e;
      for (e = x->EncryptionMethod; e; e = (struct zxmd_md_EncryptionMethod_s*)e->gg.g.n)
	  len += zxmd_LEN_md_EncryptionMethod(e);
  }


  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_md_KeyDescriptor) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_md_KeyDescriptor(struct zxmd_md_KeyDescriptor_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "KeyDescriptor", sizeof("KeyDescriptor") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->use, "use", sizeof("use")-1);


