gitpan/zxid/c/saml2md-enc.c
  /* *** deal with xmlns specifications in exc c14n way */

  len += zx_attr_len(x->ID, sizeof("ID"));
  len += zx_attr_len(x->validUntil, sizeof("validUntil"));
  len += zx_attr_len(x->cacheDuration, sizeof("cacheDuration"));
  len += zx_attr_len(x->protocolSupportEnumeration, sizeof("protocolSupportEnumeration"));
  len += zx_attr_len(x->errorURL, sizeof("errorURL"));

  {
      struct zxmd_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n)
	  len += zxmd_LEN_ds_Signature(e);
  }
  {
      struct zxmd_md_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n)
	  len += zxmd_LEN_md_Extensions(e);
  }
  {
      struct zxmd_md_KeyDescriptor_s* e;
      for (e = x->KeyDescriptor; e; e = (struct zxmd_md_KeyDescriptor_s*)e->gg.g.n)
	  len += zxmd_LEN_md_KeyDescriptor(e);
  }
  {
      struct zxmd_md_Organization_s* e;
      for (e = x->Organization; e; e = (struct zxmd_md_Organization_s*)e->gg.g.n)
	  len += zxmd_LEN_md_Organization(e);
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      for (e = x->ContactPerson; e; e = (struct zxmd_md_ContactPerson_s*)e->gg.g.n)
	  len += zxmd_LEN_md_ContactPerson(e);
  }
  {
      struct zxmd_md_AuthzService_s* e;
      for (e = x->AuthzService; e; e = (struct zxmd_md_AuthzService_s*)e->gg.g.n)
	  len += zxmd_LEN_md_AuthzService(e);
  }
  {
      struct zxmd_md_AssertionIDRequestService_s* e;
      for (e = x->AssertionIDRequestService; e; e = (struct zxmd_md_AssertionIDRequestService_s*)e->gg.g.n)
	  len += zxmd_LEN_md_AssertionIDRequestService(e);
  }
  for (se = x->NameIDFormat; se; se = (struct zx_elem_s*)se->g.n)
    len += zxmd_LEN_simple_elem(se, sizeof("NameIDFormat") - 1);


  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_md_PDPDescriptor) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_md_PDPDescriptor(struct zxmd_md_PDPDescriptor_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "PDPDescriptor", sizeof("PDPDescriptor") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->ID, "ID", sizeof("ID")-1);
  p = zx_attr_enc(p, x->validUntil, "validUntil", sizeof("validUntil")-1);
  p = zx_attr_enc(p, x->cacheDuration, "cacheDuration", sizeof("cacheDuration")-1);
  p = zx_attr_enc(p, x->protocolSupportEnumeration, "protocolSupportEnumeration", sizeof("protocolSupportEnumeration")-1);
  p = zx_attr_enc(p, x->errorURL, "errorURL", sizeof("errorURL")-1);


  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  
  {
      struct zxmd_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_ds_Signature(e, p);
  }
  {
      struct zxmd_md_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_Extensions(e, p);
  }
  {
      struct zxmd_md_KeyDescriptor_s* e;
      for (e = x->KeyDescriptor; e; e = (struct zxmd_md_KeyDescriptor_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_KeyDescriptor(e, p);
  }
  {
      struct zxmd_md_Organization_s* e;
      for (e = x->Organization; e; e = (struct zxmd_md_Organization_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_Organization(e, p);
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      for (e = x->ContactPerson; e; e = (struct zxmd_md_ContactPerson_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_ContactPerson(e, p);
  }
  {
      struct zxmd_md_AuthzService_s* e;
      for (e = x->AuthzService; e; e = (struct zxmd_md_AuthzService_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_AuthzService(e, p);
  }
  {
      struct zxmd_md_AssertionIDRequestService_s* e;
      for (e = x->AssertionIDRequestService; e; e = (struct zxmd_md_AssertionIDRequestService_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_md_AssertionIDRequestService(e, p);
  }
  for (se = x->NameIDFormat; se; se = (struct zx_elem_s*)se->g.n)
    p = zxmd_ENC_SO_simple_elem(se, p, "NameIDFormat", sizeof("NameIDFormat") - 1);


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  ZX_OUT_CH(p, '/');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "PDPDescriptor", sizeof("PDPDescriptor") - 1);
  ZX_OUT_CH(p, '>');
#else
  /* root node has no end tag ither */
#endif
  return p;
}

/* FUNC(zxmd_ENC_WO_md_PDPDescriptor) */

/* Render element into string. The XML attributes and elements are
 * processed in wire order by chasing wo pointers. This is what you want for
 * validating signatures on other people's XML documents. */

char* zxmd_ENC_WO_md_PDPDescriptor(struct zxmd_md_PDPDescriptor_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zxmd_EASY_ENC_SO_md_PDPDescriptor) */

struct zx_str_s* zxmd_EASY_ENC_SO_md_PDPDescriptor(struct zx_ctx* c, struct zxmd_md_PDPDescriptor_s* x )
{
  int len = zxmd_LEN_md_PDPDescriptor(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_SO_md_PDPDescriptor(x, buf ), buf, len);
}

/* FUNC(zxmd_EASY_ENC_WO_md_PDPDescriptor) */

struct zx_str_s* zxmd_EASY_ENC_WO_md_PDPDescriptor(struct zx_ctx* c, struct zxmd_md_PDPDescriptor_s* x )
{
  int len = zxmd_LEN_md_PDPDescriptor(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_WO_md_PDPDescriptor(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   md_RequestedAttribute
#define EL_STRUCT zxmd_md_RequestedAttribute_s
#define EL_NS     md
#define EL_TAG    RequestedAttribute

/* FUNC(zxmd_LEN_md_RequestedAttribute) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

