gitpan/zxid/c/saml2md-enc.c
int zxmd_LEN_md_RequestedAttribute(struct zxmd_md_RequestedAttribute_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("RequestedAttribute") - 1 + 1 + 2 + sizeof("RequestedAttribute") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */

  len += zx_attr_len(x->Name, sizeof("Name"));
  len += zx_attr_len(x->NameFormat, sizeof("NameFormat"));
  len += zx_attr_len(x->FriendlyName, sizeof("FriendlyName"));
  len += zx_attr_len(x->isRequired, sizeof("isRequired"));

  for (se = x->AttributeValue; se; se = (struct zx_elem_s*)se->g.n)
    len += zxmd_LEN_simple_elem(se, sizeof("AttributeValue") - 1);


  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_md_RequestedAttribute) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_md_RequestedAttribute(struct zxmd_md_RequestedAttribute_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "RequestedAttribute", sizeof("RequestedAttribute") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->Name, "Name", sizeof("Name")-1);
  p = zx_attr_enc(p, x->NameFormat, "NameFormat", sizeof("NameFormat")-1);
  p = zx_attr_enc(p, x->FriendlyName, "FriendlyName", sizeof("FriendlyName")-1);
  p = zx_attr_enc(p, x->isRequired, "isRequired", sizeof("isRequired")-1);


  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  
  for (se = x->AttributeValue; se; se = (struct zx_elem_s*)se->g.n)
    p = zxmd_ENC_SO_simple_elem(se, p, "AttributeValue", sizeof("AttributeValue") - 1);


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  ZX_OUT_CH(p, '/');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "RequestedAttribute", sizeof("RequestedAttribute") - 1);
  ZX_OUT_CH(p, '>');
#else
  /* root node has no end tag ither */
#endif
  return p;
}

/* FUNC(zxmd_ENC_WO_md_RequestedAttribute) */

/* Render element into string. The XML attributes and elements are
 * processed in wire order by chasing wo pointers. This is what you want for
 * validating signatures on other people's XML documents. */

char* zxmd_ENC_WO_md_RequestedAttribute(struct zxmd_md_RequestedAttribute_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zxmd_EASY_ENC_SO_md_RequestedAttribute) */

struct zx_str_s* zxmd_EASY_ENC_SO_md_RequestedAttribute(struct zx_ctx* c, struct zxmd_md_RequestedAttribute_s* x )
{
  int len = zxmd_LEN_md_RequestedAttribute(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_SO_md_RequestedAttribute(x, buf ), buf, len);
}

/* FUNC(zxmd_EASY_ENC_WO_md_RequestedAttribute) */

struct zx_str_s* zxmd_EASY_ENC_WO_md_RequestedAttribute(struct zx_ctx* c, struct zxmd_md_RequestedAttribute_s* x )
{
  int len = zxmd_LEN_md_RequestedAttribute(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_WO_md_RequestedAttribute(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   md_RoleDescriptor
#define EL_STRUCT zxmd_md_RoleDescriptor_s
#define EL_NS     md
#define EL_TAG    RoleDescriptor

/* FUNC(zxmd_LEN_md_RoleDescriptor) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_md_RoleDescriptor(struct zxmd_md_RoleDescriptor_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("RoleDescriptor") - 1 + 1 + 2 + sizeof("RoleDescriptor") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */

  len += zx_attr_len(x->ID, sizeof("ID"));
  len += zx_attr_len(x->validUntil, sizeof("validUntil"));
  len += zx_attr_len(x->cacheDuration, sizeof("cacheDuration"));
  len += zx_attr_len(x->protocolSupportEnumeration, sizeof("protocolSupportEnumeration"));
  len += zx_attr_len(x->errorURL, sizeof("errorURL"));

  {
      struct zxmd_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n)
	  len += zxmd_LEN_ds_Signature(e);
  }
  {
      struct zxmd_md_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n)
	  len += zxmd_LEN_md_Extensions(e);
  }
  {
      struct zxmd_md_KeyDescriptor_s* e;
      for (e = x->KeyDescriptor; e; e = (struct zxmd_md_KeyDescriptor_s*)e->gg.g.n)
	  len += zxmd_LEN_md_KeyDescriptor(e);
  }
  {
      struct zxmd_md_Organization_s* e;
      for (e = x->Organization; e; e = (struct zxmd_md_Organization_s*)e->gg.g.n)
	  len += zxmd_LEN_md_Organization(e);
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      for (e = x->ContactPerson; e; e = (struct zxmd_md_ContactPerson_s*)e->gg.g.n)
	  len += zxmd_LEN_md_ContactPerson(e);
  }


  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_md_RoleDescriptor) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_md_RoleDescriptor(struct zxmd_md_RoleDescriptor_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "RoleDescriptor", sizeof("RoleDescriptor") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->ID, "ID", sizeof("ID")-1);
  p = zx_attr_enc(p, x->validUntil, "validUntil", sizeof("validUntil")-1);
  p = zx_attr_enc(p, x->cacheDuration, "cacheDuration", sizeof("cacheDuration")-1);
  p = zx_attr_enc(p, x->protocolSupportEnumeration, "protocolSupportEnumeration", sizeof("protocolSupportEnumeration")-1);
  p = zx_attr_enc(p, x->errorURL, "errorURL", sizeof("errorURL")-1);


