gitpan/zxid/c/saml2md-enc.c
  /* *** deal with xmlns specifications in exc c14n way */


  for (se = x->AuthnContextClassRef; se; se = (struct zx_elem_s*)se->g.n)
    len += zxmd_LEN_simple_elem(se, sizeof("AuthnContextClassRef") - 1);
  for (se = x->AuthnContextDecl; se; se = (struct zx_elem_s*)se->g.n)
    len += zxmd_LEN_simple_elem(se, sizeof("AuthnContextDecl") - 1);
  for (se = x->AuthnContextDeclRef; se; se = (struct zx_elem_s*)se->g.n)
    len += zxmd_LEN_simple_elem(se, sizeof("AuthnContextDeclRef") - 1);
  for (se = x->AuthenticatingAuthority; se; se = (struct zx_elem_s*)se->g.n)
    len += zxmd_LEN_simple_elem(se, sizeof("AuthenticatingAuthority") - 1);


  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_sa_AuthnContext) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_sa_AuthnContext(struct zxmd_sa_AuthnContext_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "AuthnContext", sizeof("AuthnContext") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */



  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  
  for (se = x->AuthnContextClassRef; se; se = (struct zx_elem_s*)se->g.n)
    p = zxmd_ENC_SO_simple_elem(se, p, "AuthnContextClassRef", sizeof("AuthnContextClassRef") - 1);
  for (se = x->AuthnContextDecl; se; se = (struct zx_elem_s*)se->g.n)
    p = zxmd_ENC_SO_simple_elem(se, p, "AuthnContextDecl", sizeof("AuthnContextDecl") - 1);
  for (se = x->AuthnContextDeclRef; se; se = (struct zx_elem_s*)se->g.n)
    p = zxmd_ENC_SO_simple_elem(se, p, "AuthnContextDeclRef", sizeof("AuthnContextDeclRef") - 1);
  for (se = x->AuthenticatingAuthority; se; se = (struct zx_elem_s*)se->g.n)
    p = zxmd_ENC_SO_simple_elem(se, p, "AuthenticatingAuthority", sizeof("AuthenticatingAuthority") - 1);


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  ZX_OUT_CH(p, '/');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "AuthnContext", sizeof("AuthnContext") - 1);
  ZX_OUT_CH(p, '>');
#else
  /* root node has no end tag ither */
#endif
  return p;
}

/* FUNC(zxmd_ENC_WO_sa_AuthnContext) */

/* Render element into string. The XML attributes and elements are
 * processed in wire order by chasing wo pointers. This is what you want for
 * validating signatures on other people's XML documents. */

char* zxmd_ENC_WO_sa_AuthnContext(struct zxmd_sa_AuthnContext_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zxmd_EASY_ENC_SO_sa_AuthnContext) */

struct zx_str_s* zxmd_EASY_ENC_SO_sa_AuthnContext(struct zx_ctx* c, struct zxmd_sa_AuthnContext_s* x )
{
  int len = zxmd_LEN_sa_AuthnContext(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_SO_sa_AuthnContext(x, buf ), buf, len);
}

/* FUNC(zxmd_EASY_ENC_WO_sa_AuthnContext) */

struct zx_str_s* zxmd_EASY_ENC_WO_sa_AuthnContext(struct zx_ctx* c, struct zxmd_sa_AuthnContext_s* x )
{
  int len = zxmd_LEN_sa_AuthnContext(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_WO_sa_AuthnContext(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   sa_AuthnStatement
#define EL_STRUCT zxmd_sa_AuthnStatement_s
#define EL_NS     sa
#define EL_TAG    AuthnStatement

/* FUNC(zxmd_LEN_sa_AuthnStatement) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_sa_AuthnStatement(struct zxmd_sa_AuthnStatement_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("AuthnStatement") - 1 + 1 + 2 + sizeof("AuthnStatement") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */

  len += zx_attr_len(x->AuthnInstant, sizeof("AuthnInstant"));
  len += zx_attr_len(x->SessionIndex, sizeof("SessionIndex"));
  len += zx_attr_len(x->SessionNotOnOrAfter, sizeof("SessionNotOnOrAfter"));

  {
      struct zxmd_sa_SubjectLocality_s* e;
      for (e = x->SubjectLocality; e; e = (struct zxmd_sa_SubjectLocality_s*)e->gg.g.n)
	  len += zxmd_LEN_sa_SubjectLocality(e);
  }
  {
      struct zxmd_sa_AuthnContext_s* e;
      for (e = x->AuthnContext; e; e = (struct zxmd_sa_AuthnContext_s*)e->gg.g.n)
	  len += zxmd_LEN_sa_AuthnContext(e);
  }


  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_sa_AuthnStatement) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_sa_AuthnStatement(struct zxmd_sa_AuthnStatement_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "AuthnStatement", sizeof("AuthnStatement") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->AuthnInstant, "AuthnInstant", sizeof("AuthnInstant")-1);
  p = zx_attr_enc(p, x->SessionIndex, "SessionIndex", sizeof("SessionIndex")-1);
  p = zx_attr_enc(p, x->SessionNotOnOrAfter, "SessionNotOnOrAfter", sizeof("SessionNotOnOrAfter")-1);


