gitpan/zxid/c/saml2md-enc.c
#define EL_NAME   sa_BaseID
#define EL_STRUCT zxmd_sa_BaseID_s
#define EL_NS     sa
#define EL_TAG    BaseID

/* FUNC(zxmd_LEN_sa_BaseID) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_sa_BaseID(struct zxmd_sa_BaseID_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("BaseID") - 1 + 1 + 2 + sizeof("BaseID") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */

  len += zx_attr_len(x->NameQualifier, sizeof("NameQualifier"));
  len += zx_attr_len(x->SPNameQualifier, sizeof("SPNameQualifier"));



  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_sa_BaseID) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_sa_BaseID(struct zxmd_sa_BaseID_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "BaseID", sizeof("BaseID") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->NameQualifier, "NameQualifier", sizeof("NameQualifier")-1);
  p = zx_attr_enc(p, x->SPNameQualifier, "SPNameQualifier", sizeof("SPNameQualifier")-1);


  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  ZX_OUT_CH(p, '/');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "BaseID", sizeof("BaseID") - 1);
  ZX_OUT_CH(p, '>');
#else
  /* root node has no end tag ither */
#endif
  return p;
}

/* FUNC(zxmd_ENC_WO_sa_BaseID) */

/* Render element into string. The XML attributes and elements are
 * processed in wire order by chasing wo pointers. This is what you want for
 * validating signatures on other people's XML documents. */

char* zxmd_ENC_WO_sa_BaseID(struct zxmd_sa_BaseID_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zxmd_EASY_ENC_SO_sa_BaseID) */

struct zx_str_s* zxmd_EASY_ENC_SO_sa_BaseID(struct zx_ctx* c, struct zxmd_sa_BaseID_s* x )
{
  int len = zxmd_LEN_sa_BaseID(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_SO_sa_BaseID(x, buf ), buf, len);
}

/* FUNC(zxmd_EASY_ENC_WO_sa_BaseID) */

struct zx_str_s* zxmd_EASY_ENC_WO_sa_BaseID(struct zx_ctx* c, struct zxmd_sa_BaseID_s* x )
{
  int len = zxmd_LEN_sa_BaseID(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_WO_sa_BaseID(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   sa_Conditions
#define EL_STRUCT zxmd_sa_Conditions_s
#define EL_NS     sa
#define EL_TAG    Conditions

/* FUNC(zxmd_LEN_sa_Conditions) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_sa_Conditions(struct zxmd_sa_Conditions_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("Conditions") - 1 + 1 + 2 + sizeof("Conditions") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */

  len += zx_attr_len(x->NotBefore, sizeof("NotBefore"));
  len += zx_attr_len(x->NotOnOrAfter, sizeof("NotOnOrAfter"));

  for (se = x->Condition; se; se = (struct zx_elem_s*)se->g.n)
    len += zxmd_LEN_simple_elem(se, sizeof("Condition") - 1);
  {
      struct zxmd_sa_AudienceRestriction_s* e;
      for (e = x->AudienceRestriction; e; e = (struct zxmd_sa_AudienceRestriction_s*)e->gg.g.n)
	  len += zxmd_LEN_sa_AudienceRestriction(e);
  }
  {
      struct zxmd_sa_OneTimeUse_s* e;
      for (e = x->OneTimeUse; e; e = (struct zxmd_sa_OneTimeUse_s*)e->gg.g.n)
	  len += zxmd_LEN_sa_OneTimeUse(e);
  }
  {
      struct zxmd_sa_ProxyRestriction_s* e;
      for (e = x->ProxyRestriction; e; e = (struct zxmd_sa_ProxyRestriction_s*)e->gg.g.n)
	  len += zxmd_LEN_sa_ProxyRestriction(e);
  }


  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_sa_Conditions) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_sa_Conditions(struct zxmd_sa_Conditions_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "Conditions", sizeof("Conditions") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->NotBefore, "NotBefore", sizeof("NotBefore")-1);
  p = zx_attr_enc(p, x->NotOnOrAfter, "NotOnOrAfter", sizeof("NotOnOrAfter")-1);


  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  
  for (se = x->Condition; se; se = (struct zx_elem_s*)se->g.n)
    p = zxmd_ENC_SO_simple_elem(se, p, "Condition", sizeof("Condition") - 1);
  {
      struct zxmd_sa_AudienceRestriction_s* e;
      for (e = x->AudienceRestriction; e; e = (struct zxmd_sa_AudienceRestriction_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_sa_AudienceRestriction(e, p);
  }
  {
      struct zxmd_sa_OneTimeUse_s* e;
      for (e = x->OneTimeUse; e; e = (struct zxmd_sa_OneTimeUse_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_sa_OneTimeUse(e, p);
  }
  {
      struct zxmd_sa_ProxyRestriction_s* e;
      for (e = x->ProxyRestriction; e; e = (struct zxmd_sa_ProxyRestriction_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_sa_ProxyRestriction(e, p);
  }


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
