gitpan/zxid/c/saml2md-enc.c
  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  ZX_OUT_CH(p, '/');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "OneTimeUse", sizeof("OneTimeUse") - 1);
  ZX_OUT_CH(p, '>');
#else
  /* root node has no end tag ither */
#endif
  return p;
}

/* FUNC(zxmd_ENC_WO_sa_OneTimeUse) */

/* Render element into string. The XML attributes and elements are
 * processed in wire order by chasing wo pointers. This is what you want for
 * validating signatures on other people's XML documents. */

char* zxmd_ENC_WO_sa_OneTimeUse(struct zxmd_sa_OneTimeUse_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zxmd_EASY_ENC_SO_sa_OneTimeUse) */

struct zx_str_s* zxmd_EASY_ENC_SO_sa_OneTimeUse(struct zx_ctx* c, struct zxmd_sa_OneTimeUse_s* x )
{
  int len = zxmd_LEN_sa_OneTimeUse(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_SO_sa_OneTimeUse(x, buf ), buf, len);
}

/* FUNC(zxmd_EASY_ENC_WO_sa_OneTimeUse) */

struct zx_str_s* zxmd_EASY_ENC_WO_sa_OneTimeUse(struct zx_ctx* c, struct zxmd_sa_OneTimeUse_s* x )
{
  int len = zxmd_LEN_sa_OneTimeUse(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_WO_sa_OneTimeUse(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   sa_ProxyRestriction
#define EL_STRUCT zxmd_sa_ProxyRestriction_s
#define EL_NS     sa
#define EL_TAG    ProxyRestriction

/* FUNC(zxmd_LEN_sa_ProxyRestriction) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_sa_ProxyRestriction(struct zxmd_sa_ProxyRestriction_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("ProxyRestriction") - 1 + 1 + 2 + sizeof("ProxyRestriction") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */

  len += zx_attr_len(x->Count, sizeof("Count"));

  for (se = x->Audience; se; se = (struct zx_elem_s*)se->g.n)
    len += zxmd_LEN_simple_elem(se, sizeof("Audience") - 1);


  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_sa_ProxyRestriction) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_sa_ProxyRestriction(struct zxmd_sa_ProxyRestriction_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "ProxyRestriction", sizeof("ProxyRestriction") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->Count, "Count", sizeof("Count")-1);


  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  
  for (se = x->Audience; se; se = (struct zx_elem_s*)se->g.n)
    p = zxmd_ENC_SO_simple_elem(se, p, "Audience", sizeof("Audience") - 1);


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  ZX_OUT_CH(p, '/');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "ProxyRestriction", sizeof("ProxyRestriction") - 1);
  ZX_OUT_CH(p, '>');
#else
  /* root node has no end tag ither */
#endif
  return p;
}

/* FUNC(zxmd_ENC_WO_sa_ProxyRestriction) */

/* Render element into string. The XML attributes and elements are
 * processed in wire order by chasing wo pointers. This is what you want for
 * validating signatures on other people's XML documents. */

char* zxmd_ENC_WO_sa_ProxyRestriction(struct zxmd_sa_ProxyRestriction_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zxmd_EASY_ENC_SO_sa_ProxyRestriction) */

struct zx_str_s* zxmd_EASY_ENC_SO_sa_ProxyRestriction(struct zx_ctx* c, struct zxmd_sa_ProxyRestriction_s* x )
{
  int len = zxmd_LEN_sa_ProxyRestriction(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_SO_sa_ProxyRestriction(x, buf ), buf, len);
}

/* FUNC(zxmd_EASY_ENC_WO_sa_ProxyRestriction) */

struct zx_str_s* zxmd_EASY_ENC_WO_sa_ProxyRestriction(struct zx_ctx* c, struct zxmd_sa_ProxyRestriction_s* x )
{
  int len = zxmd_LEN_sa_ProxyRestriction(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_WO_sa_ProxyRestriction(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   sa_Subject
#define EL_STRUCT zxmd_sa_Subject_s
#define EL_NS     sa
#define EL_TAG    Subject

/* FUNC(zxmd_LEN_sa_Subject) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_sa_Subject(struct zxmd_sa_Subject_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("Subject") - 1 + 1 + 2 + sizeof("Subject") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
