gitpan/zxid/c/saml2md-enc.c
  p = zx_attr_enc(p, x->Id, "Id", sizeof("Id")-1);
  p = zx_attr_enc(p, x->Type, "Type", sizeof("Type")-1);
  p = zx_attr_enc(p, x->MimeType, "MimeType", sizeof("MimeType")-1);
  p = zx_attr_enc(p, x->Encoding, "Encoding", sizeof("Encoding")-1);


  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  
  {
      struct zxmd_xenc_EncryptionMethod_s* e;
      for (e = x->EncryptionMethod; e; e = (struct zxmd_xenc_EncryptionMethod_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_xenc_EncryptionMethod(e, p);
  }
  {
      struct zxmd_ds_KeyInfo_s* e;
      for (e = x->KeyInfo; e; e = (struct zxmd_ds_KeyInfo_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_ds_KeyInfo(e, p);
  }
  {
      struct zxmd_xenc_CipherData_s* e;
      for (e = x->CipherData; e; e = (struct zxmd_xenc_CipherData_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_xenc_CipherData(e, p);
  }
  {
      struct zxmd_xenc_EncryptionProperties_s* e;
      for (e = x->EncryptionProperties; e; e = (struct zxmd_xenc_EncryptionProperties_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_xenc_EncryptionProperties(e, p);
  }


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  ZX_OUT_CH(p, '/');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "EncryptedData", sizeof("EncryptedData") - 1);
  ZX_OUT_CH(p, '>');
#else
  /* root node has no end tag ither */
#endif
  return p;
}

/* FUNC(zxmd_ENC_WO_xenc_EncryptedData) */

/* Render element into string. The XML attributes and elements are
 * processed in wire order by chasing wo pointers. This is what you want for
 * validating signatures on other people's XML documents. */

char* zxmd_ENC_WO_xenc_EncryptedData(struct zxmd_xenc_EncryptedData_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zxmd_EASY_ENC_SO_xenc_EncryptedData) */

struct zx_str_s* zxmd_EASY_ENC_SO_xenc_EncryptedData(struct zx_ctx* c, struct zxmd_xenc_EncryptedData_s* x )
{
  int len = zxmd_LEN_xenc_EncryptedData(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_SO_xenc_EncryptedData(x, buf ), buf, len);
}

/* FUNC(zxmd_EASY_ENC_WO_xenc_EncryptedData) */

struct zx_str_s* zxmd_EASY_ENC_WO_xenc_EncryptedData(struct zx_ctx* c, struct zxmd_xenc_EncryptedData_s* x )
{
  int len = zxmd_LEN_xenc_EncryptedData(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_WO_xenc_EncryptedData(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   xenc_EncryptedKey
#define EL_STRUCT zxmd_xenc_EncryptedKey_s
#define EL_NS     xenc
#define EL_TAG    EncryptedKey

/* FUNC(zxmd_LEN_xenc_EncryptedKey) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_xenc_EncryptedKey(struct zxmd_xenc_EncryptedKey_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("EncryptedKey") - 1 + 1 + 2 + sizeof("EncryptedKey") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */

  len += zx_attr_len(x->Id, sizeof("Id"));
  len += zx_attr_len(x->Type, sizeof("Type"));
  len += zx_attr_len(x->MimeType, sizeof("MimeType"));
  len += zx_attr_len(x->Encoding, sizeof("Encoding"));
  len += zx_attr_len(x->Recipient, sizeof("Recipient"));

  {
      struct zxmd_xenc_EncryptionMethod_s* e;
      for (e = x->EncryptionMethod; e; e = (struct zxmd_xenc_EncryptionMethod_s*)e->gg.g.n)
	  len += zxmd_LEN_xenc_EncryptionMethod(e);
  }
  {
      struct zxmd_ds_KeyInfo_s* e;
      for (e = x->KeyInfo; e; e = (struct zxmd_ds_KeyInfo_s*)e->gg.g.n)
	  len += zxmd_LEN_ds_KeyInfo(e);
  }
  {
      struct zxmd_xenc_CipherData_s* e;
      for (e = x->CipherData; e; e = (struct zxmd_xenc_CipherData_s*)e->gg.g.n)
	  len += zxmd_LEN_xenc_CipherData(e);
  }
  {
      struct zxmd_xenc_EncryptionProperties_s* e;
      for (e = x->EncryptionProperties; e; e = (struct zxmd_xenc_EncryptionProperties_s*)e->gg.g.n)
	  len += zxmd_LEN_xenc_EncryptionProperties(e);
  }
  {
      struct zxmd_xenc_ReferenceList_s* e;
      for (e = x->ReferenceList; e; e = (struct zxmd_xenc_ReferenceList_s*)e->gg.g.n)
	  len += zxmd_LEN_xenc_ReferenceList(e);
  }
  for (se = x->CarriedKeyName; se; se = (struct zx_elem_s*)se->g.n)
    len += zxmd_LEN_simple_elem(se, sizeof("CarriedKeyName") - 1);


  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_xenc_EncryptedKey) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_xenc_EncryptedKey(struct zxmd_xenc_EncryptedKey_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "EncryptedKey", sizeof("EncryptedKey") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->Id, "Id", sizeof("Id")-1);
  p = zx_attr_enc(p, x->Type, "Type", sizeof("Type")-1);
  p = zx_attr_enc(p, x->MimeType, "MimeType", sizeof("MimeType")-1);
  p = zx_attr_enc(p, x->Encoding, "Encoding", sizeof("Encoding")-1);
  p = zx_attr_enc(p, x->Recipient, "Recipient", sizeof("Recipient")-1);


  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  
  {
      struct zxmd_xenc_EncryptionMethod_s* e;
      for (e = x->EncryptionMethod; e; e = (struct zxmd_xenc_EncryptionMethod_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_xenc_EncryptionMethod(e, p);
  }
  {
      struct zxmd_ds_KeyInfo_s* e;
      for (e = x->KeyInfo; e; e = (struct zxmd_ds_KeyInfo_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_ds_KeyInfo(e, p);
  }
  {
      struct zxmd_xenc_CipherData_s* e;
      for (e = x->CipherData; e; e = (struct zxmd_xenc_CipherData_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_xenc_CipherData(e, p);
  }
  {
      struct zxmd_xenc_EncryptionProperties_s* e;
      for (e = x->EncryptionProperties; e; e = (struct zxmd_xenc_EncryptionProperties_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_xenc_EncryptionProperties(e, p);
  }
  {
      struct zxmd_xenc_ReferenceList_s* e;
      for (e = x->ReferenceList; e; e = (struct zxmd_xenc_ReferenceList_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_xenc_ReferenceList(e, p);
  }
  for (se = x->CarriedKeyName; se; se = (struct zx_elem_s*)se->g.n)
    p = zxmd_ENC_SO_simple_elem(se, p, "CarriedKeyName", sizeof("CarriedKeyName") - 1);


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
