gitpan/zxid/c/saml2md-enc.c
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  ZX_OUT_CH(p, '/');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "RecipientKeyInfo", sizeof("RecipientKeyInfo") - 1);
  ZX_OUT_CH(p, '>');
#else
  /* root node has no end tag ither */
#endif
  return p;
}

/* FUNC(zxmd_ENC_WO_xenc_RecipientKeyInfo) */

/* Render element into string. The XML attributes and elements are
 * processed in wire order by chasing wo pointers. This is what you want for
 * validating signatures on other people's XML documents. */

char* zxmd_ENC_WO_xenc_RecipientKeyInfo(struct zxmd_xenc_RecipientKeyInfo_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zxmd_EASY_ENC_SO_xenc_RecipientKeyInfo) */

struct zx_str_s* zxmd_EASY_ENC_SO_xenc_RecipientKeyInfo(struct zx_ctx* c, struct zxmd_xenc_RecipientKeyInfo_s* x )
{
  int len = zxmd_LEN_xenc_RecipientKeyInfo(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_SO_xenc_RecipientKeyInfo(x, buf ), buf, len);
}

/* FUNC(zxmd_EASY_ENC_WO_xenc_RecipientKeyInfo) */

struct zx_str_s* zxmd_EASY_ENC_WO_xenc_RecipientKeyInfo(struct zx_ctx* c, struct zxmd_xenc_RecipientKeyInfo_s* x )
{
  int len = zxmd_LEN_xenc_RecipientKeyInfo(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_WO_xenc_RecipientKeyInfo(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   xenc_ReferenceList
#define EL_STRUCT zxmd_xenc_ReferenceList_s
#define EL_NS     xenc
#define EL_TAG    ReferenceList

/* FUNC(zxmd_LEN_xenc_ReferenceList) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_xenc_ReferenceList(struct zxmd_xenc_ReferenceList_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("ReferenceList") - 1 + 1 + 2 + sizeof("ReferenceList") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zxmd_xenc_DataReference_s* e;
      for (e = x->DataReference; e; e = (struct zxmd_xenc_DataReference_s*)e->gg.g.n)
	  len += zxmd_LEN_xenc_DataReference(e);
  }
  {
      struct zxmd_xenc_KeyReference_s* e;
      for (e = x->KeyReference; e; e = (struct zxmd_xenc_KeyReference_s*)e->gg.g.n)
	  len += zxmd_LEN_xenc_KeyReference(e);
  }


  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zxmd_ENC_SO_xenc_ReferenceList) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zxmd_ENC_SO_xenc_ReferenceList(struct zxmd_xenc_ReferenceList_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "ReferenceList", sizeof("ReferenceList") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */



  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  
  {
      struct zxmd_xenc_DataReference_s* e;
      for (e = x->DataReference; e; e = (struct zxmd_xenc_DataReference_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_xenc_DataReference(e, p);
  }
  {
      struct zxmd_xenc_KeyReference_s* e;
      for (e = x->KeyReference; e; e = (struct zxmd_xenc_KeyReference_s*)e->gg.g.n)
	  p = zxmd_ENC_SO_xenc_KeyReference(e, p);
  }


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  ZX_OUT_CH(p, '/');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "ReferenceList", sizeof("ReferenceList") - 1);
  ZX_OUT_CH(p, '>');
#else
  /* root node has no end tag ither */
#endif
  return p;
}

/* FUNC(zxmd_ENC_WO_xenc_ReferenceList) */

/* Render element into string. The XML attributes and elements are
 * processed in wire order by chasing wo pointers. This is what you want for
 * validating signatures on other people's XML documents. */

char* zxmd_ENC_WO_xenc_ReferenceList(struct zxmd_xenc_ReferenceList_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zxmd_EASY_ENC_SO_xenc_ReferenceList) */

struct zx_str_s* zxmd_EASY_ENC_SO_xenc_ReferenceList(struct zx_ctx* c, struct zxmd_xenc_ReferenceList_s* x )
{
  int len = zxmd_LEN_xenc_ReferenceList(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_SO_xenc_ReferenceList(x, buf ), buf, len);
}

/* FUNC(zxmd_EASY_ENC_WO_xenc_ReferenceList) */

struct zx_str_s* zxmd_EASY_ENC_WO_xenc_ReferenceList(struct zx_ctx* c, struct zxmd_xenc_ReferenceList_s* x )
{
  int len = zxmd_LEN_xenc_ReferenceList(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zxmd_ENC_WO_xenc_ReferenceList(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   xenc_Transforms
#define EL_STRUCT zxmd_xenc_Transforms_s
#define EL_NS     xenc
#define EL_TAG    Transforms

/* FUNC(zxmd_LEN_xenc_Transforms) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zxmd_LEN_xenc_Transforms(struct zxmd_xenc_Transforms_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("Transforms") - 1 + 1 + 2 + sizeof("Transforms") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
